WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
    gpioInfoAddr->DebounceDownCounter = gpioInfoAddr->DebounceConfiguredDuration;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_debounce;

    mint_add_to_timed_list_and_incr(gpioInfoAddr);

    // Start timer if not running
    turn_periodic_timer_on();
  }
  else
  {
    // The configured duration for both glitch and debounce duration is == 0?
    // This is illegal as this ISR is only for GPIOs using glitch or debounce
    // filtering which is indicated by their configured duration being > 0.
    syslog(LOG_ERR, "%s@%d-Wrong ISR mint_isr_gpio_need_delay called\n", __FILE__, __LINE__);
    usleep(20 * 1000);
    ASSERT(false);
  }

  DEBUG_SET_LOW(DEBUG_PIN_V2_A2);
  return OK;
}

//===============================================================
// This ISR is called every 100 microseconds when the timer is running
int mint_isr_periodic(int irq, void *context, void *arg)
{
  int result;
  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

  DEBUG_SET_HIGH(DEBUG_PIN_V2_A0);

  // Acknowledge the timer interrupt.
  uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);
  timStatusReg &= ~BTIM_SR_UIF;
  putreg16(timStatusReg, STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);

  // In the case where the timer was disable, but the call to this function
  // was already in flight, this code will prevent any unwanted side-effects.
  if(_allGpiosBeingTimedCnt == 0)
  {
    DEBUG_SET_LOW(DEBUG_PIN_V2_A0);
    return OK;
  }

  // Check all GPIOs currently being timed.
  int offset = 0;
  while(_allGpiosBeingTimed[offset] != NULL)
  {
    gpioInfoAddr = _allGpiosBeingTimed[offset++];

    if(gpioInfoAddr->CurrentProcessState == mint_state_mon_debounce)
    {
      //----- Debounce Filtering -----
      result = mint_process_gpio_debounce(gpioInfoAddr);
      if(result == glit_debo_ret_check_next_gpio)
        continue;     // At least 1 active GPIO to time

      // Last GPIO to be timed just finished
      if(result == glit_debo_ret_no_timed_remain)
        break;
    }

    if(gpioInfoAddr->CurrentProcessState == mint_state_mon_glitch)
    {
      //----- Glitch Filtering -----
      result = mint_process_gpio_glitch(gpioInfoAddr);
      if(result == glit_debo_ret_check_next_gpio)
        continue;     // At least 1 active GPIO to time

      // Last GPIO to be timed just finished
      if(result == glit_debo_ret_no_timed_remain)
        break;
    }

    // Should never reach here as only debounce and glitch filtering need to
    // be timed.
    syslog(LOG_ERR, "Invalid process state %d detected\n",
              gpioInfoAddr->CurrentProcessState);
    usleep(20 * 1000);
    PANIC();
  }

  // Stop Timer if no GPIO needs timing
  if(_allGpiosBeingTimedCnt == 0)
  {
    turn_periodic_timer_off();
  }

  DEBUG_SET_LOW(DEBUG_PIN_V2_A0);

  return OK;
}

//========================================================================
// Process debounce here.  Called by periodic timeout.
int mint_process_gpio_debounce(struct interruptPinMap_s *gpioInfoAddr)
{
  if(gpioInfoAddr->DebounceDownCounter == gpioInfoAddr->DebounceConfiguredDuration)
  {
    // This is the first time to process this debounce filter request

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(debo)-0x%02x DEBOUNCE Starting\n", gpioInfoAddr->PinId);
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
#endif

    // In the case both Glitch and Debounce are requested, Glitch has
    // already sent the interrupt, if it's going to. Only if Glitch does
    // send an interrupt and debounce duration is > 0, will Debounce keep
    // new interrupts inactive until debounce duration has elasped.
    if(gpioInfoAddr->GlitchConfiguredDuration == 0)
    {
      // Glitch filtering not configured but Debounce was, so send
      // interrupt now.
      mint_meadow_debounce_notification_logic(gpioInfoAddr);
    }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    else
    {
      syslog(LOG_INFO, "mint-(debo)-0x%02x Debounce started following Glitch\n", gpioInfoAddr->PinId);
    }
#endif
  }

  // This is the start of Debounce processing.
  // Step one is to notify the Meadow.Core by sending an interrupt, unless one
  // already sent by glitch filtering. Ignoring all GPIO state transitions
  // until the specified amount of time has elasped.

  // Decrement the timeout count. When it reaches 0, re-enbled the gpio interrupts.
  gpioInfoAddr->DebounceDownCounter--;
  if(gpioInfoAddr->DebounceDownCounter > 0)
    return glit_debo_ret_check_next_gpio;   // Not done yet

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  uint32_t procTime = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
  syslog(LOG_INFO, "mint-(debo)-0x%02x Debounce proccessing ended in %d ms\n",
            gpioInfoAddr->PinId, procTime);
#endif

  // Finished with debounce timing. Since the GPIO state should now be stable,
  // save it for next time, especially for rqstdintmode_both
  gpioInfoAddr->LastKnownGpioState = mint_read_current_gpio_state(gpioInfoAddr);

  // Terminate this GPIO's capture by removing from the list and changing the
  // processing state.
  mint_remove_from_timed_list_and_decr(gpioInfoAddr);

  // Reset the state so the next GPIO state changes will begin the timing
  // process once again.
  gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;

  if(_allGpiosBeingTimedCnt == 0)
    return glit_debo_ret_no_timed_remain;  // No more work to do, so quit loop too

  return glit_debo_ret_check_next_gpio;   // Go to next gpio
}

//========================================================================
// Glitch filtering is processed here. Called by periodic timeout.
int mint_process_gpio_glitch(struct interruptPinMap_s *gpioInfoAddr)
{
  if(gpioInfoAddr->GlitchTimeoutsCounter == 0)
  {
    // First time to process glitch or restarting after glitch detected
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch Starting\n", gpioInfoAddr->PinId);
#endif
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
  }

  gpioInfoAddr->GlitchTimeoutsCounter++;

  // If GlitchConfiguredDuration is greater than
  // MEADOW_INTERRUPT_GLITCH_TIME_USE_MS we use time based, not count
  // based to establish completion. This is because using counts is more
  // accurate for short delays (having 100 usec resolution). And long delays
  // accumulate an increasing error. Also, if GlitchConfiguredDuration is
  // greater than MEADOW_INTERRUPT_GLITCH_TIME_USE_MS we'll only read
  // the GPIO state every millisecond not every timer interrupt.
  if(gpioInfoAddr->GlitchConfiguredDuration > MEADOW_INTERRUPT_GLITCH_TIME_USE_MS)
  {
    // Using sys time so check about every millisecond not every 100 microseconds.
    if(gpioInfoAddr->GlitchTimeoutsCounter % MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR != 0)
      return glit_debo_ret_check_next_gpio;
  }

