WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  uint8_t currentState = mint_read_current_gpio_state(gpioInfoAddr);

  if(currentState != gpioInfoAddr->GlitchPrevGpioState)
  {
    // GPIO state has changed from previous, save the new state and restart
    // the timer.
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
    gpioInfoAddr->GlitchTimeoutsCounter = 0;
    gpioInfoAddr->GlitchPrevGpioState = currentState;

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch state changed was:%d now:%d\n",
          gpioInfoAddr->PinId, gpioInfoAddr->GlitchPrevGpioState, currentState);
#endif
    return glit_debo_ret_check_next_gpio;   // Keep waiting
  }

  // GPIO State stable since last check?
  if(gpioInfoAddr->GlitchConfiguredDuration > MEADOW_INTERRUPT_GLITCH_TIME_USE_MS)
  {
    // Check elapsed time based on sys clock
    uint32_t elapedTimeMs = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
    if(elapedTimeMs < gpioInfoAddr->GlitchConfiguredDuration/MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR)
      return glit_debo_ret_check_next_gpio;   // Not done yet
  }
  else
  {
    // Check elapsed time based on 100 usec timer
    if(gpioInfoAddr->GlitchTimeoutsCounter < gpioInfoAddr->GlitchConfiguredDuration)
      return glit_debo_ret_check_next_gpio;   // Need to keep checking
  }

  // We've found a stable state!
  // Finished checking, GPIO state stable for filter time.
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  uint32_t totalTime = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
  syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch completed in %d ms, timeouts:%d\n",
          gpioInfoAddr->PinId, totalTime, gpioInfoAddr->GlitchTimeoutsCounter);
#endif

  // Need to determine if an interrupt notification needs to be sent to
  // Meadow.Core.
  if(gpioInfoAddr->LastKnownGpioState != currentState)
  {
    bool isRising = gpioInfoAddr->LastKnownGpioState < currentState;
    switch(gpioInfoAddr->GpioInterruptMode)
    {
      case rqstdintmode_both:
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying Meadow.Core, rqstdintmode_both\n", gpioInfoAddr->PinId);
#endif
        mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        break;

      case rqstdintmode_falling:
        if(!isRising)
        {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying, Falling and config rqstdintmode_falling\n", gpioInfoAddr->PinId);
#endif
          mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        else
        {
          syslog(LOG_INFO, "mint_(glitch)-0x%02x ignoring, Rising but config rqstdintmode_falling\n", gpioInfoAddr->PinId);
        }
#endif
        break;

      case rqstdintmode_rising:
        if(isRising)
        {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying, Rising and config rqstdintmode_rising\n", gpioInfoAddr->PinId);
#endif
          mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        else
        {
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Ignoring, Falling but config rqstdintmode_rising\n", gpioInfoAddr->PinId);
        }
#endif
        break;

      default:
      case rqstdintmode_none:
        syslog(LOG_ERR, "%s@%d-0x%02x illegal interrupt mode:%d\n",
                  __FILE__, __LINE__, gpioInfoAddr->PinId, gpioInfoAddr->GpioInterruptMode);
        break;
    }
  }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  else
  {
    // gpioInfoAddr->LastKnownGpioState == currentState i.e. no change. It's a glitch, ignore it
    syslog(LOG_INFO, "mint_(glitch)-0x%02x No GPIO state change-Ignore\n", gpioInfoAddr->PinId);
  }
#endif

  gpioInfoAddr->LastKnownGpioState = currentState;

  //---------------------------------------------------------------------------
  // We reached the end of the glitch filtering time requested. What should be
  // done? Should we switch to debounce filtering or end filtering for this
  // GPIO.
  if(gpioInfoAddr->DebounceConfiguredDuration > 0)
  {
    // Debounce is configured to follow the glitch filtering
    gpioInfoAddr->DebounceDownCounter = gpioInfoAddr->DebounceConfiguredDuration;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_debounce;

   // Move to next GPIO (the debounce will be processed next time)
   return glit_debo_ret_check_next_gpio;
  }
  else
  {
    // Remove this GPIO from being timed
    mint_remove_from_timed_list_and_decr(gpioInfoAddr);

    // Reset the state so the next GPIO state change will begin the timing
    // process again.
    gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;

    if(_allGpiosBeingTimedCnt == 0)
      return glit_debo_ret_no_timed_remain;  // No more work to do, so quit loop too
  }

  return glit_debo_ret_check_next_gpio;
}

//==================================================================
// This code is only used for notifying Meadow.Core for debounce
int mint_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t newState;
  
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  syslog(LOG_INFO, "mint-(debounce)-0x%02x Debounce alone, no Glitch\n", gpioInfoAddr->PinId);
#endif

  switch(gpioInfoAddr->GpioInterruptMode)
  {
    // Perfect debounce filtering is not possible due to the MCU not providing the GPIO
    // state that originally generated the interrupt. Therefore, we must assume that the
    // user is using it correctly and they understand what applications are appropriate.
    // All this is because we cannot accurately read the GPIO state at the instant we receive
    // the interrupt notification, it may have changed. If the desired interrupt mode is
    // 'rising' or 'falling' we assume the state based on the configuration, depending on
    // the MCU to only send the requested types. In the case of 'both' we have no choice
    // but to assume that the last known state was valid and send the opposite state.
    case rqstdintmode_both:
      // Assume the opposite state, that's the best we can do.
      // The LastKnownGpioState was updated after the debounce timeout period.
      newState = gpioInfoAddr->LastKnownGpioState == 1 ? 0 : 1;
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_both \n", gpioInfoAddr->PinId, newState);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_falling:
      newState = 0;      // Assume high to low transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_falling\n", gpioInfoAddr->PinId, 0);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_rising:
      newState = 1;      // Assume low to high transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_rising\n", gpioInfoAddr->PinId, 1);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, 1);  
      break;

    case rqstdintmode_none:
    default:
      syslog(LOG_ERR, "%s@%d-0x%02x unexpected case:%d\n",
              __FILE__, __LINE__, gpioInfoAddr->PinId, gpioInfoAddr->GpioInterruptMode);
      break;
  }
  return OK;
}

//===============================================================
// Forward interrupt info to Meadow.Core
int mint_forward_interrupt_to_core(struct interruptPinMap_s *gpioInfoAddr, uint8_t state)
{
  int ret;
  extern mqd_t s_int_queue;
  
  // Timing must be finished
  DEBUG_SET_LOW(DEBUG_PIN_V2_A3);

  // Forward to Meadow.Core
  char queue_buffer[MINT_MSG_QUEUE_MSG_SIZE];
  queue_buffer[0] = gpioInfoAddr->PinId;
  queue_buffer[1] = state;

  // This message queue is opened in
  // /Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow-upd.c when the upd
  // is opened
  ret = mq_send(s_int_queue, queue_buffer, MINT_MSG_QUEUE_MSG_SIZE, 0);
  if(ret < 0)
  {
    if(errno == ENOMEM)
    {
      syslog(LOG_ERR, "0x%02x Queue overflow (too fast?)\n", gpioInfoAddr->PinId);
    }
    else
    {
      syslog(LOG_ERR, "%s@%d-0x%02x mq_send failed:%d, errno:%d\n", __FILE__, __LINE__, 
          gpioInfoAddr->PinId, ret, get_errno());
    }
  }

  return ret;
}

//===============================================================
uint8_t mint_read_current_gpio_state(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t pinNumb = gpioInfoAddr->PinId & 0x0f;
  uint32_t idrRegisterValues = *((uint32_t *)(gpioInfoAddr->IDRAddress));
  return (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
}

//===============================================================
// When an interrupt occurs that must be monitored it is added to this
// list. This list is used by the periodic ISR to time glitch and debounce
// activity. Once the timing has completed it is removed from this list.
void mint_add_to_timed_list_and_incr(struct interruptPinMap_s *gpioInfoAddr)
{
  // Find first empty slot
  for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
  {
    if(_allGpiosBeingTimed[i] == NULL)
    {
      _allGpiosBeingTimed[i] = gpioInfoAddr;
      _allGpiosBeingTimedCnt++;
      break;
    }
  }
}

//===============================================================
// Removes from the timer isr
void mint_remove_from_timed_list_and_decr(struct interruptPinMap_s *gpioInfoAddr)
{
  int activeOffset;

